{
  "navbar":{
    "home":"Home",
    "mathematics":"Mathematics",
    "math-list":{
      "vectorGeo":"Vector Geometry",
      "algebra":"Algebra",
      "calculus":"Calculus"
    },
    "physics":"Physics",
    "physics-list":{
      "mechanics":"Mechanics",
      "electromagnetism":"Electromagnetism",
      "computational":"Computational physics"
    },
    "programming":"Programming",
    "programming-list":{
      "segurity":"Informatic segurity",
      "blog":"Programmer blog"
    },
    "motivation":"Motivation",
    "tutorials":"Tutorials",
    "login":"Log in",
    "signup":"Sign up",
    "exit":"Exit"
  },
  "footer":{
    "contact":"Contact",
    "aboutUs":"About us",
    "termsConditions":"Terms and Conditions"
  },
  "home":{
    "readMore":"...Read more",
    "readLess":"Read less",
    "content":{
      "language":"Change Language to:",
      "whatMath":"What is pure math?",
      "whatMathText":"Pure mathematics is the study of mathematical concepts independently of any application outside  mathematics.  These concepts may originate in real-world concerns, and the results obtained may later turn  out to be useful for practical applications, but pure mathematicians are not primarily motivated by  such applications.",
      "instead":"Instead, the appeal is attributed to the intellectual challenge and aesthetic beauty of working out the logical consequences of basic principles. While pure mathematics has existed as an activity since at least Ancient Greece, the concept was elaborated upon around the year 1900, after the introduction of theories with counter-intuitive properties (such as non-Euclidean geometries and Cantor's theory of infinite sets), and the discovery of apparent paradoxes (such as continuous functions that are nowhere differentiable, and Russell's paradox). This introduced the need to renew the concept of mathematical rigor and rewrite all mathematics accordingly, with a systematic use of axiomatic methods. This led many mathematicians to focus on mathematics for its own sake, that is, pure mathematics.",
      "wikipedia":"Wikipedia definition",
      "goodVideo":"Good video about mathematics(Spanish)",
      "mathQuotes":"Some math quotes",
      "quote1Dirac":"It seems to be one of the fundamental features of nature that fundamental physics laws are described in terms of a mathematical theory ofgreat beauty andpower, needing quite a high standard ofmathematics for one understand it. You may wonde'r: why is nature constructed along these lines? One can only answer that our present knowledge seems to show that nature is so constructed. We simply have to accept it. One could perhaps describe the situation by saying that Cod is a mathematician of a ver' high order, and He used very advanced mathematics in constructing the Universe.",
      "quote2Dirac":"It is more important to have beauty in one’s equation than to have them fit experiment",
      "quoteNorth":"Let us grant that the pursuit of mathematics is a divine madness of the human spirit.",
      "whatPhysics":"What is the physics?",
      "whatPhysicsText1":"Physics is the natural science that studies matter, its fundamental constituents, its motion and behavior through space and time, and the related entities of energy and force. Physics is one of the most fundamental scientific disciplines, and its main goal is to understand how the universe behaves.",
      "whatPhysicsText2":"Physics is one of the oldest academic disciplines and, through its inclusion of astronomy, perhaps the oldest. Over much of the past two millennia, physics, chemistry, biology, and certain branches of mathematics were a part of natural philosophy, but during the Scientific Revolution in the 17th century these natural sciences emerged as unique research endeavors in their own right. Physics intersects with many interdisciplinary areas of research, such as biophysics and quantum chemistry, and the boundaries of physics are not rigidly defined. New ideas in physics often explain the fundamental mechanisms studied by other sciences and suggest new avenues of research in these and other academic disciplines such as mathematics and philosophy.",
      "whatPhysicsText3":"Advances in physics often enable advances in new technologies. For example, advances in the understanding of electromagnetism, solid-state physics, and nuclear physics led directly to the development of new products that have dramatically transformed modern-day society, such as television, computers, domestic appliances, and nuclear weapons; advances in thermodynamics led to the development of industrialization; and advances in mechanics inspired the development of calculus."
    },
    "lateral":{
      "Gauss1":"Was a German mathematician, geodesist, and physicist who made significant contributions to many fields in mathematics and science.",
      "Gauss2":"Gauss had an exceptional influence in many fields of mathematics and science and ranks among history's most influential mathematicians.",
      "Galois1":"Was a French mathematician and political activist. While still in his teens, he was able to determine a necessary and sufficient condition",
      "Galois2":"for a polynomial to be solvable by radicals, thereby solving a problem that had been open for 350 years. His work laid the foundations for Galois theory and group theory, two major branches of abstract algebra. He was a staunch republican and was heavily involved in the political turmoil that surrounded the French Revolution of 1830.",
      "Newton1":"Was an English mathematician, physicist, astronomer, alchemist, theologian, and author who was described in his time as a natural philosopher.",
      "Newton2":"He was a key figure in the Scientific Revolution and the Enlightenment that followed. His pioneering book Philosophiæ Naturalis Principia Mathematica (Mathematical Principles of Natural Philosophy), first published in 1687, consolidated many previous results and established classical mechanics. Newton also made seminal contributions to optics, and shares credit with German mathematician Gottfried Wilhelm Leibniz for developing infinitesimal calculus.",
      "Ramanujan":"Was Indian mathematician whose contributions to the theory of numbers include pioneering discoveries of the properties of the partition function.",
      "Pythagoras1":"Greek philosopher, mathematician, and founder of the Pythagorean brotherhood that, although religious in nature, ",
      "Pythagoras2":"formulated principles that influenced the thought of Plato and Aristotle and contributed to the development of mathematics and Western rational philosophy. (For a fuller treatment of Pythagoras and Pythagorean thought, see Pythagoreanism).",
      "Perelman1":"Russian mathematician who was awarded—and declined—the Fields Medal in 2006",
      "Perelman2":"for his work on the Poincaré conjecture and Fields medalist William Thurston’s geometrization conjecture. In 2003 Perelman had left academia and apparently had abandoned mathematics. He was the first mathematician ever to decline the Fields Medal."
    }
  },
  "physics-module":{
    "history":"History",
    "mechanics":{
      "history-text":"Mechanical physics is a branch of physics that focuses on the study of motion and the forces that cause it. Throughout history, numerous scientists have contributed to the development of mechanics,from the first observations to the most advanced theories.",
      "Aristotle":{
        "title":"Aristotle",
        "text1":"Aristotle (384-322 BC): Aristotle was one of the first philosophers to address the study of movement. He proposed a geocentric theory in which he believed that objects fell at different speeds depending on their weight, an idea that prevailed for centuries.",
        "subtitle1":"The Classical Elements:",
        "text2":"The ancient Greeks are often credited with discovering, or at least providing the concept for, the atom. Indeed, one Greek philosopher, Democritus, probably did believe this, or at least provided the theory as a topic for debate. However, the majority of Greeks who gave thought to the subject believed that the smallest unit that anything could be divided into was the element.",
        "text3":"Aristotle named four elements; fire, air, earth and water. However, for some years after this, philosophers argued which of these four elements was the main one. Thales argued that everything was made of water, while Heraclitus disagreed and claimed that fire was the major element, and Anaximenes refused to believe either and put forward air as the obvious candidate."
      },
      "Galileo":{
        "text1":"Galileo Galilei (1564-1642): Galileo performed pioneering experiments on the movement and fall of objects. He discovered that all objects, regardless of their mass, fall at the same rate in a uniform gravitational field. He also formulated the laws of motion and laid the foundation for the law of inertia.",
        "text2":{
          "part0":"Galileo Galilei was an Italian scientist of the 16th and 17th centuries, considered one of the fathers of modern science. His contributions revolutionized physics and astronomy. Some of his most notable achievements include:",
          "part1":"Laws of Motion: Galileo developed the law of inertia, which states that an object in motion will remain in motion unless an external force is applied to it. He also described the uniformly accelerating acceleration of objects in free fall.",
          "part2":"Astronomical observations: Galileo was one of the first to use a telescope to make detailed astronomical observations. His discoveries included the phases of Venus, the moons of Jupiter, and the mountains and craters of the Moon, which supported Copernicus's heliocentric theory.",
          "part3":"Law of falling bodies: Galileo demonstrated that all objects, regardless of their mass, fall at the same rate under the influence of gravity, thus refuting the Aristotelian belief that heavier objects fall faster than lighter objects .",
          "part4":"Scientific method: Galileo advocated the use of experimentation and careful observation as a means of understanding the natural world, thus laying the foundation for the modern scientific method."
        },
        "quotes":{
          "title":"Quotes:",
          "quote1":"You can't teach a man anything; He can only be helped to find the answer within himself.",
          "quote2":"Philosophy is written in this great book that is continually open before our eyes (I mean the universe), but it cannot be understood if we do not first learn to understand the language and know the characters in which it is written. It is written in mathematical language and its characters are triangles, circles and other geometric figures, without which it is impossible to understand a single word; Without them we wander through a dark labyrinth."
        }
      },
      "Newton":{
        "text1":"Isaac Newton (1643-1727): Newton consolidated Galileo's ideas and formulated the laws of motion and the law of universal gravitation. His contributions revolutionized physics and astronomy, providing a mathematical framework for understanding and predicting the motion of objects."
      },
      "threeBody":{
        "threeBodyProblem":"Three-body problem",
        "text1":"The gravitational interaction between three celestial bodies is a classic problem in celestial mechanics that still has no general analytical solution. The complexity of this problem has led to the development of numerical methods and the study of chaotic systems."
      },
      "doublePendulum":{
        "doublePendulum":"Double pendulum problem",
        "text1":"A classic problem in mechanics is the study of the double pendulum, which presents chaotic behaviors and is an example of nonlinear dynamic systems.",
        "text2":"The double pendulum is a dynamic system in physics that consists of two simple pendulums connected to each other. This system is of interest in physics due to its chaotic behavior and the richness of dynamic phenomena it exhibits. The relationship between the double pendulum and physics can be explored in several aspects:"
      },
      "rigidBody":{
        "rigidBody":"Rigid body problem",
        "text1":"The study of rotating rigid bodies has led to the development of rigid mechanics and has found applications in engineering and vehicle dynamics."
      },
      "Einstein":{
        "EinsteinTheory":"Einstein's theory of relativity",
        "text1":"In the early 20th century, Albert Einstein proposed the theory of relativity, which transformed the understanding of gravity. The theory of general relativity describes gravity as a curvature of space-time caused by the presence of mass and energy."
      },
      "quantumMechanics":{
        "quantumMechanics":"Quantum mechanics",
        "text1":"At the subatomic level, quantum mechanics replaced classical mechanics. Developed in the first half of the 20th century, quantum mechanics describes the behavior of subatomic particles and has led to technologies such as quantum electronics.",
        "subtitle1":"Double-slit experiment",
        "text2":"In modern physics, the double-slit experiment demonstrates that light and matter can satisfy the seemingly incongruous classical definitions for both waves and particles, which is considered evidence for the fundamentally probabilistic nature of quantum mechanics. This type of experiment was first performed by Thomas Young in 1801, as a demonstration of the wave behavior of visible light. At that time it was thought that light consisted of either waves or particles. With the beginning of modern physics, about a hundred years later, it was realized that light could in fact show both wave and particle characteristics. In 1927, Davisson and Germer and, independently George Paget Thomson and his research student Alexander Reid demonstrated that electrons show the same behavior, which was later extended to atoms and molecules. Thomas Young's experiment with light was part of classical physics long before the development of quantum mechanics and the concept of wave–particle duality. He believed it demonstrated that Christiaan Huygens' wave theory of light was correct, and his experiment is sometimes referred to as Young's experiment or Young's slits."
      },
      "celestialMechanics":{
        "celestialMechanics":"Celestial mechanics",
        "text1":"The history of celestial mechanics has its roots in ancient civilizations that observed the movement of celestial bodies and developed theories to explain it. However, one of the most important milestones in the development of celestial mechanics was the formulation of the laws of planetary motion by Johannes Kepler in the 17th century. Kepler discovered that the planets move in elliptical orbits around the Sun, and established three empirical laws that describe these movements.",
        "text2":"Isaac Newton later revolutionized our understanding of celestial mechanics with his major work, ''Principia Mathematica,'' published in 1687. In this work, Newton formulated the law of universal gravitation, which states that the force of attraction between two bodies is directly proportional to the product of their masses and inversely proportional to the square of the distance between them. This law made it possible to accurately explain and predict the movements of the planets, moons and other celestial bodies.",
        "subtitle1":"Gravitational intensity",
        "text3":"Newton was the one who introduced the concept of a gravitational field, which is a mathematical description of how mass causes a gravitational force that acts on other masses in its environment. This field can be represented by a vector that indicates the direction and magnitude of the gravitational force at each point in space.",
        "subtitle2":"Gravitational potential",
        "text4_1":"The gravitational potential, on the other hand, is a scalar function that describes how the gravitational potential energy changes as a function of position in the gravitational field. This concept is fundamental in celestial mechanics to calculate the movement of celestial bodies.",
        "text4_2":"Newton developed these ideas in his major work, ''Philosophiæ Naturalis Principia Mathematica'' (Principia), published in 1687. In this work, he presented the equations that describe the law of universal gravitation and how it relates to the gravitational field and the gravitational potential."
      }
    },
    "electromagnetism":{
      "historyText":"The history of electromagnetism is a fascinating narrative that spans several centuries and has involved numerous key scientists and researchers. This story can be divided into several notable sections:",
      "discovery":{
        "title1":"Discovery of Electricity (17th-18th Century)",
        "text1":"The discovery and understanding of electricity developed throughout the 17th and 18th centuries, with key contributions from several scientists who performed fundamental experiments and observations. Below are some important milestones in the history of the discovery of electricity during that period:",
        "text2":"He conducted experiments with static electricity, observing the attraction and repulsion of electrified objects.",
        "text3":"He distinguished between conductors and insulators. He discovered that some materials could transport electricity.",
        "text4":"He proposed the existence of two types of electricity, which he called 'vitreous' (positive) and 'resinous' (negative).",
        "text5_1":"* He contributed significantly to the understanding of electricity.",
        "text5_2":"* He conducted experiments with comets to demonstrate the electrical nature of lightning.",
        "text5_3":"* Proposed the electric fluid model and developed the single fluid theory of electricity.",
        "text6":"Invented the capacitor, also known as the Leyden jar, a device for storing electrical charge.",
        "text7":"He also contributed to the development of the Leyden condenser at the same time as Musschenbroek.",
        "text8":"He discovered that certain conductors could discharge electricity from a capacitor.",
        "text9":"He developed the theory that electricity is a fluid composed of individual electrical particles."
      },
      "Development":{
        "Development":"Development of Electrical Theory",
        "text1":"Discovery of static electricity: In the 18th century, experiments with objects such as rubbed amber and glass led to the discovery of static electricity. Prominent figures in this field include William Gilbert, Otto von Guericke, and Stephen Gray.",
        "text2":"Laws of electrical behavior: Charles-Augustin de Coulomb in the 18th century established the fundamental laws of electrostatics, including Coulomb's Law which describes the force between electric charges.",
        "text3":"Invention of the voltaic cell: In 1800, Alessandro Volta invented the voltaic cell, the first electric battery that could produce a constant electric current. This advance was fundamental to the development of electrolysis and the understanding of electric current.",
        "text4":"Electric flow theory: In the 1820s, André-Marie Ampère developed the theory of electric flow, which established the fundamental laws of magnetism and the interaction between electric currents.",
        "text5":"Laws of Electrodynamics: In the 1830s, Michael Faraday formulated the laws of electrodynamics, including Faraday's law of electromagnetic induction, which states that a change in the magnetic field across a circuit induces an electric current in the circuit. circuit.",
        "text6":"Development of mathematical theory: James Clerk Maxwell in the 19th century unified electrical and magnetic phenomena into a coherent set of equations known as Maxwell's equations. These equations form the basis of electromagnetic theory and predicted the existence of electromagnetic waves, confirmed experimentally by Heinrich Hertz.",
        "text7":"These are just some of the major milestones in the development of electrical theory during the 18th and 19th centuries. These advances laid the foundation for the technological revolution that transformed modern society, from electric lighting to wireless communications."
      },
      "Research":{
        "Research":"Research in Magnetism",
        "text1":"During the 18th and 19th centuries, research in magnetism experienced significant advances that laid the foundation for our modern understanding of this phenomenon.",
        "text2":"Early discoveries of magnetism: Magnetism has been observed and studied since ancient times, but it was in the 18th century that more systematic advances were made in its understanding. Experiments with natural magnetic materials such as magnetite (iron oxide) led to the discovery of basic magnetic properties.",
        "text3":"Laws of magnetism: Charles-Augustin de Coulomb, known for his research in electricity, also contributed to the study of magnetism in the 18th century. He established fundamental laws for magnetic interaction, which are analogous to Coulomb's laws for electrical interaction.",
        "text4":"Beginnings of electromagnetic theory: Although considered primarily a 19th century figure, the work of Hans Christian Oersted in 1820 was seminal. He discovered that an electric current can generate a magnetic field, laying the foundation for the connection between electricity and magnetism.",
        "text5":"Development of the theory of magnetism: William Gilbert was a prominent figure in the 16th century who conducted experiments and formulated theories about magnetism, establishing the foundations of modern research in this field. However, his ideas were significantly developed and refined in the following centuries.",
        "text6":"Research on magnetization and molecular magnetism: In the 19th century, scientists such as André-Marie Ampère and Michael Faraday conducted important research on the molecular nature of magnetism and the magnetization of materials. His experiments helped to better understand how atoms and molecules in magnetic materials are organized and behave.",
        "text7":"Advances in magnetic technology: During this period, there were also significant advances in the practical application of magnetism, including the invention of improved magnetic compasses, the creation of more powerful artificial magnets, and the development of techniques to magnetize and demagnetize materials as needed.",
        "text8":"These are just some of the major milestones in magnetism research during the 18th and 19th centuries. These advances laid the foundation for later developments in fields such as physics, electrical engineering, materials technology, and many other areas of modern science and technology."
      },
      "Unification":{
        "Unification":"Unification of Electricity and Magnetism",
        "text1":"During the 19th century, there was a notable unification of the fields of electricity and magnetism, culminating in the development of electromagnetic theory.",
        "text2":"Discovery of the relationship between electricity and magnetism: In 1820, Hans Christian Oersted performed a crucial experiment that showed that an electric current could generate a magnetic field. This discovery was fundamental to demonstrate the intimate connection between electricity and magnetism.",
        "text3":"Ampère's laws and formulation of electrodynamics: André-Marie Ampère, in the 1820s, formulated the laws that describe the interaction between electric currents and the magnetic fields they generate. These laws laid the foundation for the formulation of electrodynamics, the branch of physics that studies the interactions between electricity and magnetism.",
        "text4":"Development of mathematical theory: James Clerk Maxwell in the 1860s developed a set of equations that unified the laws of electromagnetism known until then. These equations, known as Maxwell's equations, describe how electric and magnetic fields interact and propagate in space.",
        "text5":"Prediction of electromagnetic waves: Based on Maxwell's equations, Maxwell predicted the existence of electromagnetic waves, which travel at the speed of light and are generated by accelerations of electric charges. These waves include visible light and other forms of electromagnetic radiation.",
        "text6":"Experimental confirmation of Maxwell's predictions: Maxwell's predictions about electromagnetic waves were confirmed experimentally by Heinrich Hertz in the 1880s. Hertz demonstrated the existence and propagation of these waves, which provided strong empirical confirmation of the unified theory of the electromagnetism.",
        "text7":"Establishment of electromagnetic theory: The unification of electricity and magnetism into a single coherent theory, based on Maxwell's equations, is one of the most significant milestones in the history of physics. This theory provided a unified framework for understanding a wide range of electromagnetic phenomena and paved the way for numerous technological applications, including telecommunications, electronics, and power generation.",
        "text8":"These are some of the major milestones in the unification of electricity and magnetism during the 19th century, a process that transformed our understanding of the physical world and laid the foundation for the development of modern physics and associated technology."
      }
    }
  },
  "login":{
    "email":"Email",
    "password":"Password",
    "login":"Login",
    "rememberMe":"Remember me",
    "help":"Need help?",
    "new":"New to mundoSteam?",
    "signUpNow":"Sign up now",
    "advantages":"Advantages of login:",
    "advantage1":"Access to tables with data on useful books, dealing with different topics such as those presented above (mathematics, physics, programming)",
    "advantage2":"Contact us in an easier way",
    "advantage3":"Integrate more with the members of this mundoStem community"
  },
  "signUp":{
    "name":"Name",
    "email":"Email",
    "password":"Password",
    "signUp":"Sign Up",
    "rememberMe":"Remember me",
    "help":"Need help?",
    "account":"You have an account?",
    "loginNow":"Login now"
  }

}
