{
  "navbar":{
    "home":"Inicio",
    "mathematics":"Matemáticas",
    "math-list":{
      "vectorGeo":"Geometria vectorial",
      "algebra":"Álgebra",
      "calculus":"Cálculo"
    },
    "physics":"Física",
    "physics-list":{
      "mechanics":"Mecánica",
      "electromagnetism":"Electromagnetismo",
      "computational":"Física computacional"
    },
    "programming":"Programación",
    "programming-list":{
      "segurity":"Seguridad Informática",
      "blog":"Blog de programación"
    },
    "motivation":"Motivación",
    "tutorials":"Tutoriales",
    "login":"Ingresar",
    "signup":"Registrarse",
    "exit":"Salir"
  },
  "footer":{
    "contact":"Contacto",
    "aboutUs":"Sobre nosotros",
    "termsConditions":"Términos y condiciones"
  },
  "home":{
    "readMore":"...Leer más",
    "readLess":"Leer menos",
    "content":{
      "language":"Cambiar idioma a:",
      "whatMath":"¿Qué es la matemática pura?",
      "whatMathText":"La matemática pura es el estudio de conceptos matemáticos independientemente de cualquier aplicación fuera de las matemáticas. Estos conceptos pueden originarse en preocupaciones del mundo real, y los resultados obtenidos pueden resultar más tarde útiles para aplicaciones prácticas, pero los matemáticos puros no están motivados principalmente por tales aplicaciones.",
      "instead":"Más bien, el atractivo se atribuye al desafío intelectual y la belleza estética de elaborar las consecuencias lógicas de los principios básicos. Si bien las matemáticas puras han existido como actividad al menos desde la antigua Grecia, el concepto se desarrolló alrededor del año 1900, después de la introducción de teorías con propiedades contrarias a la intuición (como las geometrías no euclidianas y la teoría de los conjuntos infinitos de Cantor), y el descubrimiento de paradojas aparentes (como funciones continuas que no son diferenciables en ninguna parte y la paradoja de Russell). Esto introdujo la necesidad de renovar el concepto de rigor matemático y reescribir todas las matemáticas en consecuencia, con un uso sistemático de métodos axiomáticos. Esto llevó a muchos matemáticos a centrarse en las matemáticas por sí mismas, es decir, en las matemáticas puras.",
      "wikipedia":"Definición de wikipedia",
      "goodVideo":"Buen video sobre matemáticas (español)",
      "mathQuotes":"Algulas citas matemáticas",
      "quote1Dirac":"Parece ser una de las características fundamentales de la naturaleza que las leyes físicas fundamentales se describen en términos de una teoría matemática de gran belleza y poder, y que se necesita un nivel matemático bastante alto para entenderla. Quizás te preguntes: ¿por qué la naturaleza se construye de esta manera? Sólo se puede responder que nuestro conocimiento actual parece mostrar que la naturaleza está construida de esa manera. Simplemente tenemos que aceptarlo. Quizás se podría describir la situación diciendo que Dios es un matemático de muy alto nivel y que utilizó matemáticas muy avanzadas para construir el Universo.",
      "quote2Dirac":"Es más importante tener belleza en la ecuación que hacer ajustes en el experimento.",
      "quoteNorth":"Concedamos que la búsqueda de las matemáticas es una locura divina del espíritu humano.",
      "whatPhysics":"¿Qué es la física?",
      "whatPhysicsText1":"La física es la ciencia natural que estudia la materia, sus constituyentes fundamentales, su movimiento y comportamiento a través del espacio y el tiempo, y las entidades relacionadas de energía y fuerza. La física es una de las disciplinas científicas más fundamentales y su principal objetivo es comprender cómo se comporta el universo.",
      "whatPhysicsText2":"La física es una de las disciplinas académicas más antiguas y, gracias a la inclusión de la astronomía, quizás la más antigua. Durante gran parte de los últimos dos milenios, la física, la química, la biología y ciertas ramas de las matemáticas fueron parte de la filosofía natural, pero durante la Revolución Científica del siglo XVII estas ciencias naturales surgieron como esfuerzos de investigación únicos por derecho propio. La física se cruza con muchas áreas interdisciplinarias de investigación, como la biofísica y la química cuántica, y los límites de la física no están definidos rígidamente. Las nuevas ideas en física a menudo explican los mecanismos fundamentales estudiados por otras ciencias y sugieren nuevas vías de investigación en éstas y otras disciplinas académicas como las matemáticas y la filosofía.",
      "whatPhysicsText3":"Los avances en física a menudo permiten avances en nuevas tecnologías. Por ejemplo, los avances en la comprensión del electromagnetismo, la física del estado sólido y la física nuclear condujeron directamente al desarrollo de nuevos productos que han transformado dramáticamente la sociedad moderna, como la televisión, las computadoras, los electrodomésticos y las armas nucleares; los avances en termodinámica condujeron al desarrollo de la industrialización; y los avances en la mecánica inspiraron el desarrollo del cálculo."
    },
    "lateral":{
      "Gauss1":"Fue un matemático, geodesta y físico alemán que hizo importantes contribuciones en muchos campos de las matemáticas y las ciencias. ",
      "Gauss2":"Gauss tuvo una influencia excepcional en muchos campos de las matemáticas y la ciencia y se encuentra entre los matemáticos más influyentes de la historia.",
      "Galois1":"Fue un matemático y activista político francés. Cuando aún era un adolescente, pudo determinar una condición necesaria y suficiente",
      "Galois2": "para que un polinomio pudiera resolverse mediante radicales, resolviendo así un problema que había estado abierto durante 350 años. Su trabajo sentó las bases de la teoría de Galois y la teoría de grupos, dos ramas principales del álgebra abstracta. Era un republicano acérrimo y estuvo muy involucrado en la agitación política que rodeó la Revolución Francesa de 1830.",
      "Newton1":"Fue un matemático, físico, astrónomo, alquimista, teólogo y autor inglés que fue descrito en su época como un filósofo natural. ",
      "Newton2":"Fue una figura clave en la Revolución Científica y la Ilustración que siguió. Su libro pionero Philosophiæ Naturalis Principia Mathematica (Principios matemáticos de la filosofía natural), publicado por primera vez en 1687, consolidó muchos resultados anteriores y estableció la mecánica clásica. Newton también hizo contribuciones fundamentales a la óptica y comparte el mérito con el matemático alemán Gottfried Wilhelm Leibniz por desarrollar el cálculo infinitesimal.",
      "Ramanujan":"Fue un matemático indio cuyas contribuciones a la teoría de números incluyen descubrimientos pioneros de las propiedades de la función de partición.",
      "Pythagoras1":"Filósofo, matemático griego y fundador de la hermandad pitagórica que, aunque de carácter religioso, ",
      "Pythagoras2":"formuló principios que influyeron en el pensamiento de Platón y Aristóteles y contribuyeron al desarrollo de las matemáticas y la filosofía racional occidental. (Para un tratamiento más completo de Pitágoras y el pensamiento pitagórico, consulte Pitagorismo).",
      "Perelman1":"Matemático ruso que recibió (y rechazó) la Medalla Fields en 2006 ",
      "Perelman2":"por su trabajo sobre la conjetura de Poincaré y la conjetura de geometrización del medallista Fields William Thurston. En 2003, Perelman había abandonado la academia y aparentemente había abandonado las matemáticas. Fue el primer matemático en rechazar la Medalla Fields."
    }
  },
  "physics-module":{
    "history":"Historia",
    "mechanics":{
      "history-text":"La física mecánica es una rama de la física que se centra en el estudio del movimiento y las fuerzas que lo provocan. A lo largo de la historia, numerosos científicos han contribuido al desarrollo de la mecánica, desde las primeras observaciones hasta las teorías más avanzadas.",
      "Aristotle":{
        "title":"Aristoteles",
        "text1":"Aristóteles (384-322 a.C.): Aristóteles fue uno de los primeros filósofos en abordar el estudio del movimiento. Propuso una teoría geocéntrica en la que creía que los objetos caían a diferentes velocidades dependiendo de su peso, idea que prevaleció durante siglos.",
        "subtitle1":"Los elementos clásicos:",
        "text2":"A los antiguos griegos a menudo se les atribuye el descubrimiento, o al menos el concepto del átomo. De hecho, un filósofo griego, Demócrito, probablemente creía esto, o al menos proporcionó la teoría como tema de debate. Sin embargo, la mayoría de los griegos que reflexionaron sobre el tema creían que la unidad más pequeña en la que se podía dividir algo era el elemento.",
        "text3":"Aristóteles nombró cuatro elementos; fuego, aire, tierra y agua. Sin embargo, durante algunos años después de esto, los filósofos discutieron cuál de estos cuatro elementos era el principal. Tales argumentó que todo estaba hecho de agua, mientras que Heráclito no estaba de acuerdo y afirmaba que el fuego era el elemento principal, y Anaxímenes se negó a creer en ninguno de los dos y propuso el aire como el candidato obvio."
      },
      "Galileo":{
        "text1":"Galileo Galilei (1564-1642): Galileo realizó experimentos pioneros sobre el movimiento y caída de objetos. Descubrió que todos los objetos, independientemente de su masa, caen al mismo ritmo en un campo gravitacional uniforme. También formuló las leyes del movimiento y sentó las bases de la ley de la inercia.",
        "text2":{
          "part0":"Galileo Galilei fue un científico italiano del siglo XVI y XVII, considerado uno de los padres de la ciencia moderna. Sus contribuciones revolucionaron la física y la astronomía. Algunos de sus logros más destacados incluyen:",
          "part1":"Leyes del movimiento: Galileo desarrolló la ley de la inercia, que establece que un objeto en movimiento permanecerá en movimiento a menos que se aplique una fuerza externa sobre él. También describió la aceleración uniformemente acelerada de los objetos en caída libre.",
          "part2":"Observaciones astronómicas: Galileo fue uno de los primeros en utilizar un telescopio para realizar observaciones astronómicas detalladas. Sus descubrimientos incluyen las fases de Venus, las lunas de Júpiter y las montañas y cráteres de la Luna, lo que apoyó la teoría heliocéntrica de Copérnico.",
          "part3":"Ley de la caída de los cuerpos: Galileo demostró que todos los objetos, independientemente de su masa, caen al mismo ritmo bajo la influencia de la gravedad, refutando así la creencia aristotélica de que los objetos más pesados caen más rápido que los objetos más ligeros.",
          "part4":"Método científico: Galileo defendió el uso de la experimentación y la observación cuidadosa como medios para comprender el mundo natural, sentando así las bases del método científico moderno."
        },
        "quotes":{
          "title":"Citas:",
          "quote1":"No se puede enseñar nada a un hombre; solo se le puede ayudar a encontrar la respuesta dentro de sí mismo.",
          "quote2":"La filosofía está escrita en este grandísimo libro que continuamente está abierto ante nuestros ojos (me refiero al universo), pero no se puede entender si primero no se aprende a entender la lengua y conocer los caracteres en que está escrito. Está escrito en lenguaje matemático y sus caracteres son triángulos, círculos y otras figuras geométricas, sin las cuales es imposible entender una sola palabra; sin ellos vagamos por un oscuro laberinto."
        }
      },
      "Newton":{
        "text1":"Isaac Newton (1643-1727): Newton consolidó las ideas de Galileo y formuló las leyes del movimiento y la ley de la gravitación universal. Sus contribuciones revolucionaron la física y la astronomía, proporcionando un marco matemático para comprender y predecir el movimiento de los objetos."
      },
      "Three-body problem":"Problema de tres cuerpos",
      "Three-body":{

      }
    }


  },
  "login":{
    "email":"Correo",
    "password":"Contraseña",
    "login":"Ingresar",
    "rememberMe":"Recuerdame",
    "help":"¿Necesitas ayuda?",
    "new":"¿Nuevo en mundoSteam?",
    "signUpNow":"Registrate ahora",
    "advantages":"Ventajas del login:",
    "advantage1":"Acceso a tablas con datos sobre libros utiles, tratando diferentes temas como los expuestos anteriormente (matemáticas,física.programación)",
    "advantage2":"Contacta con nosotros de una forma mas facil",
    "advantage3":"Integrate más con los miembros de esta comunidad mundoStem"
  },
  "signUp":{
    "name":"Nombre",
    "email":"Correo",
    "password":"Contraseña",
    "signUp":"Registrarse",
    "rememberMe":"Recuerdame",
    "help":"¿Necesitas ayuda?",
    "account":"Tienes una cuenta?",
    "loginNow":"Ingresar ahora"
  }

}
